Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The expression [max] @scores».key».chars gives the largest of these values.
ja: 式[max] @scores».key».charsはそれらのもっとも大きい値です。

source: The expression [max] @scoresｻ.keyｻ.chars gives the largest of these values.
ja: 式[max] @scores».key».charsはそれらの値の最も長いものを得ます。

source: The extra verbosity of marking parameters as mutable or immutable may seem excessive at first, but as an average user, it's unlikely that you'll need to use these traits often.
ja: 最初のうちはパラメータに対する可変か不変かの冗長なマーキングは過剰に見えます。しかし一般ユーザーはこれらのトレイトを頻繁に使う必要はありません。

source: The final candidate is a fallback for the cases not covered yet--every case in which Player Two wins.
ja: 最終的な候補はまだカバーされない ― プレイヤー2が勝つすべてのケース ― ケースのための頼れるものです。

source: The first capture, (\w+), was quantified, so $/[0] contains a list of words.
ja: 最初のキャプチャー(\w+)は数量化されているので、$/[0]はワードのリストを含みます。

source: The first declaration specifies instance storage for a callback -- a bit of code to invoke in order to perform the task that an object represents:
ja: 最初の宣言は、コールバックのためにインスタンス・ストレージを指定します－オブジェクトが表す仕事を実行するために呼び出すわずかなコード：

source: The first extracts and stores the names of the two players in the variables $p1 and $p2.
ja: 最初は2人のプレーヤーの名前を変数$p1と$p2に抽出して保存します。

source: The first line is the list of players.
ja: 最初の行はプレーヤーのリストです。

source: The first parameter is the callback (the thing to do to execute the task).
ja: 最初のパラメータはコールバック（タスクを実行するためのもの）です。

source: The first string is the name of the player and the second is the bar.
ja: 最初の文字列はプレーヤーの名前です。そして、第2はバーです。

source: The first three lines inside the class block all declare attributes (called fields or instance storage in other languages).
ja: クラスブロック内の最初の3行は全て属性を宣言します（他の言語ではフィールドまたはインスタンスストレージと呼ばれます）。

source: The first two lines introduce a grammar that inherits from JSON::Tiny::Grammar.
ja: 最初の2行は、JSON::Tiny::Grammarから継承するグラマーを導入します。

source: The first two tests each smart-match against a class name.
ja: 最初の2つは各々のクラス名に対してスマートマッチをテストします。

source: The flattening or slicing of any such returned parcel will be dependent on how the gather's return iterator is iterated (with .get vs .getarg).
ja: そのような返されたパーセルの平坦化またはスライシングはgatherの返したイテレータがどのように反復するかに依存している（.get対.getarg）。

source: The following example demonstrates how to parse JSON, a data exchange format already introduced (see link).
ja: 以下の例はJSON（既に広まっているデータ交換フォーマット）を解析する方法を示します。（リンクを見みてください）

source: The following operations are available for strings:
ja: 以下の演算子は文字列で利用できます：

source: The following operators are available for all number types:
ja: 以下の演算子は、すべての数型に利用できます：

source: The following paragraph seems out of place.
ja: （次の文節は不適切かもしれません。）

source: The following program shows how a dependency handler might look in Perl 6.
ja: 以下のプログラムはPerl 6で依存ハンドラがどのように見えるか示します。

source: The following treats every other value in @values as modifiable:
ja: 次のコードは@valuesの値を一つ置きに変更可能として扱う：

source: The former constructs a regex object.
ja: 前者は正規表現オブジェクトを構築します。

source: The former reuses the argument list and the latter allows the use of a different argument list.
ja: 前者は引数リストを再利用します。そして後者は異なる引数リストを使用可能にします。

source: The fourth candidate, multi wins(::T $, T $) { 0 } uses ::T, which is a type capture (similar to generics or templates in other programming languages).
ja: 第4候補のmulti wins(::T $, T $) { 0 }は::Tを使っていますが、それは型キャプチャです（他の言語のジェネリクスまたはテンプレートに似ています）。

source: The function (or listop) form always exits from the innermost block, returning its arguments as the final value of the block exactly as return does.
ja: 関数（またはリスト演算子）形式は常に最も深いブロックから抜け出し、returnがするようにブロックの最後の値としてその引数を返す。

source: The general loop statement
ja: 一般のループ文

source: The implicit break (what succeed does explicitly) of a when block is abnormal.
ja: whenブロックの暗黙の中断（succeedは明示的に行う）はアブノーマルだ。

source: The implicit break of a normal when block works the same way, returning the value of the entire block (normally from its last statement) via an implicit succeed.
ja: 通常のwhenブロックの暗黙の脱出は同じ方法の動作で、暗黙のsucceedを経て全体のブロック（通常はその最後の文）の値を返す。

source: The infix max operator returns the greater of two values, so 2 max 3 returns 3.
ja: 接中辞max演算子は2つの値でより大きな値を返すもので、2 max 3は3を返します。

source: The infix x operator, or repetition operator, generates this bar.
ja: 接中辞x演算子、または繰返し演算子はこのバーを出力します。

source: The infix cmp operator is a type sensitive three-way comparison operator which compares numbers like <=>, strings like leg, and (for example) pairs first by key, and then by value if the keys are identical:
ja: 接中辞cmp演算子は型に敏感な三者間の比較演算子で、<=>のように数値を比較し、legのように文字列を比較し、（例えば）ペアでは最初にキー、キーが同一なら値を比較します：

source: The initializing expression is evaluated at BEGIN time.
ja: 初期化式はBEGIN時に評価される。

source: The input data (stored in a file called "scores") looks like this:
ja: 入力データ（“scores”という名前のファイルに保存されている）は、このような格好です：

source: The key type of a hash may be specified as a shape trait--see S09.
ja: ハッシュのキーの型はshapeトレイトとして指定されます ― S09を見てください。

source: The keyword for individual cases is when:
ja: 個々のケースのキーワードはwhenだ：

source: The latter constructs the regex object and immediately matches it against the topic variable $_.
ja: 後者は正規表現オブジェクトを構築し、そしてトピック変数$_に対してすぐにマッチします。

source: The leading question mark indicates an zero-width assertion: a rule that never consumes characters from the matched string.
ja: 先行クエスチョンマークはゼロ幅アサーションを示します： マッチされた文字列から文字を決して消費しないルールです。

source: The lexical scope supplies the declared target for the dynamic operation.
ja: レキシカルスコープは動的な操作のために宣言されたターゲットを供給する。

source: The line:
ja: この行：

source: The list is evaluated lazily by default, so instead of using a while to read a file a line at a time as you would in Perl 5:
ja: デフォルトではリストは不精に評価されるので、Perl 5ではファイルを一行ずつ読み込むために代わりにwhileを使う：

source: The list-like part contains the positional arguments and the hash-like parts contains the named arguments.
ja: リストのような部分は位置引数と名前付き引数を含むハッシュのような部分を含んでいます。

source: The lookup inside on-message stores a Role in $plug-in.
ja: on-messageの内側の検索は、ロールを$plug-inに保存します。

source: The loop conditional on a repeat block is required, so it will be recognized even if you put it on a line by its own:
ja: repeatブロックのループ条件が必要なので、 それを独自の行に置いても評価される：

source: The match object produced from that call is accessible as $<dup><word>.
ja: その呼び出しから作り出されるマッチオブジェクトは、$<dup><word>としてアクセスできます。

source: The method form will leave any block in the dynamic scope that can be named as an object and that responds to the .leave method.
ja: メソッド形式はオブジェクトとして名前付けでき、.leaveメソッドに応答するダイナミックスコープの何か一つのブロックを抜け出すだろう。

source: The method itself takes the passed parameter--which must be an instance of the Task class--and pushes it onto the invocant's @!dependencies attribute.
ja: メソッド自身は渡されたパラメータを受け取ります ― それはTaskクラスのインスタンスでなければなりません ― そしてそれをインボカントの@!dependencies属性にプッシュします。

source: The most general quantifier is **.
ja: 最も一般的な数量詞は**です。

source: The most important types are:
ja: 最も重要な型は以下の通りです：

source: The name of the lexical variable to bind to, if any
ja: バインドするレキシカル変数の名前

source: The negated character class is a special application of this idea.
ja: 否定の文字クラスは、このアイデアの特別な適用です。

source: The negated form of this, :!name, has an implicit value of Bool::False.
ja: 否定の形式、:!nameは暗黙にBool::Falseを持ちます。

source: The new constant declarator introduces a compile-time constant, either a variable or named value, which may be initialized with a pseudo-assignment:
ja: 新しいconstant宣言は変数または名前付きの値にコンパイル時の定数をもたらし、擬似割り当てで初期化されるだろう：

source: The new sub is like any other sub, and works with all the various parameter-passing schemes already described.
ja: 新しいサブルーチンは他のサブルーチンのように様々なパラメーター渡しの機構が既に記述されています。

source: The next line containing new features is:
ja: 新機能を含んでいる次の行は、以下の通りです：

source: The next two lines follow the same pattern:
ja: 次の2行は同じパターンが続きます：

source: The nominal type
ja: 名目型

source: The only exceptions to that are the backslash, square brackets and the dash -, which need to be escaped with a backslash:
ja: それに対する唯一の例外はバックスラッシュ、ブラケットとダッシュ-です。そして、それはバックスラッシュでエスケープされる必要があります：

source: The only remaining difficulty arises if both the user and a library writer attempt to use dynamic gather with user-defined callbacks that contain take.
ja: ユーザーとライブラリ作者がダイナミックなgatherをtakeを含むユーザー定義のコールバックと使用しようと試みるなら、唯一残っている難しさが生じる。

source: The operators <, <=, >=, and > compare the relative size of numbers.
ja: 演算子<、<=、>=そして>は数の相対的なサイズを比較します。

source: The original object stays the same.
ja: 最初のオブジェクトは、同じもののままです。

source: The other action methods work the same way.
ja: 他のアクションメソッドは同じ方法で動作します。

source: The other case is a list which contains at least one value--the pivot--and possibly other values to partition according to the pivot.
ja: 他のケースは少なくとも1つの値 ― 中心点 ― と中心点によって分割される可能な他の値を含むリストです。

source: The other way round, converting a JSON string to a Perl 6 data structure, is covered in the chapter link.
ja: 反対にJSON文字列をPerl6データ構造に変換することはリンクの章で取り上げます。

source: The outer regex will still backtrack, so it can retry the regex word at a different staring position.
ja: 外側の正規表現はまだバックトラックするので、それは異なる位置を凝視している正規表現wordを再び試みることができます。

source: The output after the second call is at least 1.
ja: 2回目の呼び出しの後の出力は、少なくとも1です。

source: The output can look like this:
ja: 出力はこのようになります：

source: The parenthesized form of type coercion may be used in declarations where it makes sense to accept a wider set of types but coerce them to a narrow type.
ja: 括弧に入れられた形式の型制約は、広いセットを受け入れるが、狭く制限されることが意味を成す宣言で使われます。

source: The plus + stands for one or more occurrences, \w+ usually matches what you might consider a word (though only matches the first three characters from isn't because ' isn't a word character).
ja: プラスの+は一つ以上の発生を表します、\w+はあなたがワードと考えられるものに通常はマッチします（しかしisn'tからは最初の3文字だけにマッチします。'はワード文字ではないからです）。

source: The previous chapter already used other types of operators.
ja: 前の章は、他のタイプの演算子をすでに使いました。

source: The previous example to match a list of words was:
ja: ワードのリストにマッチする前の例は、以下の通りでした：

source: The previous value of $_ is not available within the loop.
ja: $_の前の値はループ内では使用できない。

source: The process of role composition is simple.
ja: ロール合成のプロセスは単純です。

source: The program next determines the maximum score:
ja: 次のプログラムは最大のスコアを決定します：

source: The program takes advantage of this property of Perl 6's sort to achieve the goal by sorting twice: first by the number of sets won (the secondary criterion), then by the number of matches won.
ja: プログラムは2度ソートすることで目的を達成するために、Perl 6のsortのこの特性を利用します：最初に勝ったセット数（第2の基準）、それから勝った試合数です。

source: The program then counts the number of sets each player has won:
ja: それからプログラムは、各々のプレーヤーが獲得したセット数を数えます：

source: The program will exhaust memory before it ever prints 'A' or 'B'.
ja: プログラムはこれまでに'A'または'B'を出力する前にメモリーを空にします。

source: The programmer here has made a mistake and should choose to compose only one role to provide the desired behavior.
ja: ここでのプログラマーは間違いをしています。そして、望ましい振る舞いを提供するために1つのロールだけを合成すること選ぶべきです。

source: The real insight for me was realizing that transforming trees is the best way to write a compiler, but I don't expect readers to have gone through the trouble of writing compilers the hard way first.
ja: ツリーを変形することがコンパイラを記述する最善の方法であると認識していましたが、私は最初にコンパイラを書くという難しい方法で読者にトラブルを経験させたいと思っていません。

source: The recursive calls demonstrate a powerful truth of multidispatch: these calls do not necessarily recurse to the Array candidate, but dispatch to the appropriate candidate based on the types of their arguments.
ja: 再帰呼び出しはマルチディスパッチの強力な事実を示します：それらはArray候補に必ずしも再帰するというわけではありません。しかしそれらの引数の型に基づいて適切な候補をディスパッチします。

source: The reduction method calls the .ast method on each matched pair and installs the result list in its own AST.
ja: 還元メソッドはマッチしたペアの各々で.astメソッドを呼び、それ自身のASTに結果リストをインストールします。

source: The reduction method for object extracts the AST of the pairlist submatch and turns it into a hash by calling its hash method.
ja: objectのための還元メソッドはpairlistサブマッチのASTを抜き出し、そのhashメソッドを呼ぶことによってハッシュに変えます。

source: The referees tell you the results of each game in the format Player1 Player2 | 3:2, which means that Player1 won against Player2 by 3 to 2 sets.
ja: レフェリーは、あなたに各々のゲームの結果をPlayer1 Player2 | 3:2というフォーマットで伝えます。それはPlayer1が3対2セットでPlayer2に対して勝利したことを意味します。

source: The regex does not match the string eggs, milk, sugarandflour.
ja: 正規表現は、文字列にeggs, milk, sugarandflourにマッチするものを見つけません。

source: The regex first anchors to a left word boundary with « so that it doesn't match partial duplication of words.
ja: 最初の正規表現は«で左の単語境界に固定するので、部分的なワードの重複にマッチしません。

source: The rest of quicksort is a couple of recursive calls to sort both partitions:
ja: 残りのクイックソートは両方の分割を分類する二、三の再帰的呼び出しです：

source: The rest of the expression is merely a list of constants evaluated, then discarded.
ja: 式の残りは単に定数と評価されるリストで、破棄されます。

source: The rest of the parameters are dependent Task instances.
ja: 残りのパラメータは従属するTaskのインスタンスです。

source: The rest of this chapter assumes some implicit knowledge that readers likely won't have now.
ja: この章の残りは、読者が現在は望んでいないと思われるいくつかの潜在的な知識を想定します。

source: The result of a conditional statement is the result of the block chosen to execute.
ja: 条件文の結果はブロックが実行に選んだ結果になる。

source: The return value is a list of Pair objects, the keys of which are the names or numbers of the capture and the values the corresponding Match objects.
ja: 戻り値はPairオブジェクトのリストで、名前のキーまたはキャプチャーと値の数に対応するMatchオブジェクトです。

source: The right side of the + operator is more complicated.
ja: 右側の+演算子はより複雑です。

source: The right-hand side calls a method --a named group of behavior-- named get on the file handle stored in $file.
ja: 右側はメソッド ― 名前を付けられた振る舞いのグループ ― getを$fileに格納されたファイルハンドルに対して呼び出します。

source: The right-hand side of the assignment is a call to a method named split, passing along the string ' | ' as an argument.
ja: 割り当ての右側はsplitという名前のメソッドの呼び出しです。文字列' | 'を引数として渡します。

source: The role AnswerIfTalkedTo declares a stub for the method bot-nick, but never provides an implementation.
ja: ロールAnswerIfTalkedToはメソッドbot-nickのためにスタブを宣言しますが、実装を決して提供しません。

source: The role composer will produce a compile-time error about this conflict, asking the programmer to provide a resolution.
ja: ロールコンポーザーはこの競合についてコンパイル時エラーを出すでしょう。そして、プログラマーに解決を提供するよう頼みます。

source: The role composer will verify that all of the role's requirements are satisfied once and only once, and from then on Perl's type system will consider all instances of the class as corresponding to the type implied by the role.
ja: ロールコンポーザーはロールの必要条件のすべてが一回だけ満たされることを確かめるでしょう。そしてその時以来、Perlの型システムはクラスの全てのインスタンスがロールによる型と暗黙に一致することをよく考えるでしょう。

source: The routine returns 0 to indicate a draw.
ja: ルーチンはドローを示すために0を返します。

source: The rules for deciding if a value is true or false depend on the type of the value:
ja: 値が真か偽か決定する規則は、型の値に依存します：

source: The second declaration also uses the private twigil:
ja: 2回目の宣言も、プライベートtwigilを使います：

source: The second example makes the comparison case insensitive by comparing not the values, but their upper case equivalents.
ja: 第2の例は比較を値でなく、それらの大文字の等価物を比較することによって大文字と小文字の区別をしなくします。

source: The second extracts the results for each player and stores them in $r1 and $r2.
ja: 2番目は各々のプレーヤーの成績を得て、それらを$r1と$r2に保存します。

source: The second method contains the main logic of the dependency handler:
ja: 第2のメソッドは、依存ハンドラーのメインのロジックを含みます：

source: The semantics of INIT and once are not equivalent to each other in the case of cloned closures.
ja: INITとonceのセマンティクスは他のそれぞれの複製されたクロージャとは同等ではない。

source: The separator can itself be a regex.
ja: セパレーター自体を正規表現にすることができます。

source: The separator is matched between two occurrences of the quantified regex.
ja: セパレーターは2つの数量化された正規表現の間にマッチします。

source: The signature (::T $, T $) will bind only two objects of the same type, or where the second is a subtype of the first.
ja: シグネチャー(::T $, T $)は同じ型の2つのオブジェクトをバインドするか、2番目は1番目のサブタイプです。

source: The signature binding approach might seem clumsy, but when you use it in the main signature of a subroutine, you get tremendous power:
ja: シグネチャーバインディングアプローチは不恰好かもしれませんが、サブルーチンのメインのシグネチャーでそれを使うとき、あなたは相当なパワーを得ます：

source: The signature of the method on-message captures the invocant into a variable $self marked rw, which indicates that the invocant may be modified.
ja: メソッドon-messageのシグネチャーは、インボカントが変更されることを示すrwにマークされた変数$selfのインボカントを捕えます。

source: The signature will only match if the multi has a single parameter which is an empty list.
ja: マルチが空のリストである一つのパラメータを持っているならば、シグネチャーはマッチするだけでしょう。

source: The similarity of grammars to classes goes deeper than storing regexes in a namespace as a class might store methods.
ja: グラマーとクラスの類似性は、クラスがメソッドを格納するように正規表現を名前空間に格納するよりより深いものです。

source: The simplest case of a regex is a constant string.
ja: 正規表現で最も単純なケースは固定文字列です。

source: The simplest enhancement is to allow such a comment in any place where whitespace is valid.
ja: 最も単純な拡張は、空白が有効なところでそのようなコメントを許可することです。

source: The simplest way to sort the players by score would be @names.sort({ %matches{$_} }), which sorts by number of matches won.
ja: スコアによってプレイヤーをソートする最も単純な方法は@names.sort({ %matches{$_} })です。それは試合に勝った数でソートします。

source: The smart match operator always decides what kind of comparison to do based upon the type of the value on the right hand side.
ja: スマートマッチ演算子は、常に右側の値の型に基づいてどんな比較をするべきかについて決めます。

source: The solution to this is the same as with the cycle-detection in Question 2: introducing an attribute $!started.
ja: これの解決は問題2の循環検出と同じです：属性$!startedを導入します。

source: The sort method then orders the values according to that return value:
ja: sortメソッドはその返り値によって値を整理します：

source: The special variable $/ stores the match object, which allows you inspect the matched text.
ja: 特殊変数$/はマッチオブジェクトを格納します。そして、それはあなたがマッチしたテキストを調べることを可能にします。

source: The specific implementation used to run this test actually executes the where-block twice.
ja: 実際にこのテストを走らせるのに用いられる特定の実装は、二回whereブロックを実行します。

source: The statement form can be particularly useful to expose a lexically scoped declaration to the surrounding lexical scope without "trapping" it inside a block.
ja: 文形式はブロック内の「トラッピング」なしのレキシカルスコープで囲まれた宣言を公開するのに便利だ。

source: The string matched by the first group of parentheses is available in $/[0], the second in $/[1], etc. $/ acts as an array containing the captures from each parentheses group:
ja: 最初のグループの括弧でマッチした文字列は$/[0]で利用できます。2番目は$/[1]、など。$/はそれぞれの括弧グループのキャプチャーを含む配列として振る舞います：

source: The syntax for this backreference is a dollar sign followed by the name of the capture in angle brackets (footnote: In grammars--see (grammars)--<word> looks up a regex named word in the current grammar and parent grammars, and creates a capture of the same name.).
ja: この後方参照のための構文は、かぎ括弧でキャプチャーという名で追従されるドル記号です（脚注：grammarsで－grammars（文法）を見てください－<word>は現在の文法と親文法でwordという名の正規表現の上で見て、同じ名前のキャプチャーを作ります。）。

source: The syntax of calling method with .^ instead of a single dot means that it is actually a method call on the meta class, which is a class managing the properties of the Employee class - or any other class you are interested in.
ja: シングルドットの代わりの.^は実際はメタクラスのメソッドコールで、それはEmployeeのプロパティを管理します ― またはあなたが興味のある他のクラスです。

source: The third attribute represents the state of completion of a task:
ja: 第3の属性は、仕事の完成の状態を表します：

source: The three-way comparison operators take two operands, and return Order::Increase if the left is smaller, Order::Same when both are equal, and Order::Decrease if the right operand is smaller (footnote: Order::Increase, Order::Same, and Order::Decrease are enumerations (enums); see link ).
ja: 三者間の比較演算子は2つのオペランドを取り、左がより小さいならOrder::Increaseを、両者が等しいならOrder::Sameを、右のオペランドがより小さいならOrder::Decreaseを返します（注釈：Order::Increase、 Order::Same、そしてOrder::Decreaseは列挙（enums）です；リンクを見てください）。

source: The trigonometric functions sin, cos, tan, asin, acos, atan, sec, cosec, cotan, asec, acosec, acotan, sinh, cosh, tanh, asinh, acosh, atanh, sech, cosech, cotanh, asech, acosech and acotanh work in units of radians by default.
ja: 三角関数sin、cos、tan、asin、acos、atan、sec、cosec、cotan、asec、acosec、acotan、sinh、cosh、tanh、asinh、acosh、atanh、sech、cosech、cotanh、asech、acosech、acotanhはデフォルトでラジアン単位で動作します。

source: The type inside the parens indicates the acceptable set of types that are allowed to be bound or assigned to this location via coercion.
ja: 括弧の内側の型は、強制によってこの場所にバインドするか割り当てられることを許可された許容できる型のセットを示します。

source: The unhandled list is a dynamic variable so that it's easy for .resume to manipulate it.
ja: ハンドルされないリストはダイナミックな変数なので.resumeがそれを扱うのは簡単だ。

source: The upshot of this is that--after reading the chapter on writing classes and methods--you too will be able to write things that can smart-match just by implementing an ACCEPTS method to do the right thing.
ja: これの結果は ― クラスとメソッドを記述した章を読んだ後に ― 正しいことをするためにACCEPTSメソッドを実装するだけでスマートマッチできるものを書くことができます。

source: The use of the term bound instead of assigned is significant here.
ja: バインドされたという用語を割り当てられたの代わりに使うことはここでは重要です。

source: The value of a loop statement is the list of values from each iteration.
ja: ループ文の値はそれぞれの反復の値のリストになる。

source: The value of the conditional expression may be optionally bound to a closure parameter:
ja: 条件式の値はクロージャのパラメータに任意に結び付けられるだろう：

source: The value returned by the take to the take's own context is that same returned argument (which is ignored when the take is in sink context).
ja: takeからtake自身のコンテキストに返された値は返された同じ引数だ（それはtakeがsinkコンテキストの時は無視される）。

source: The various comparison operators all coerce their arguments to certain types before comparing them.
ja: いろいろな比較演算子は、それらを比較する前に特定の型に対するそれらの引数をすべて自動変換します。

source: The word returns is allowed as an alias for of.
ja: returnsがofの別名として使用可能です。

source: The word character after the comma is not part of the match, because it is in a look-ahead introduced by <&quest;before ... >.
ja: コンマの後のワード文字はマッチの一部ではありません。なぜなら<&quest;before ... >によって導入される先読みだからです。

source: The word character after the comma is not part of the match, because it is in a look-ahead introduced by <?before ... >.
ja: コンマの後のワード文字はマッチの一部ではありません。なぜなら<？before ... > によって導入される先読みだからです。

source: Then it matches the previous capture followed by a right word boundary.
ja: それから、適切な単語境界が続く前のキャプチャーにマッチします。

source: Then it returns the incremented value; my $x = 1; say ++$x prints 2.
ja: そうすると、それはインクリメントされた値を返します；my $x = 1; say ++$xは2と出力します。

source: Then press Compose-key and the "greater than" key twice.) or text editor (footnote: Emacs users can type C-x 8 Enter 00bb Enter, vim users can type C-k >>.) does not make it easy to write it you can also write it using two angle brackets (>>).
ja: Then press Compose-key and the "greater than" key twice.)またはテキストエディタ(footnote: Emacs users can type C-x 8 Enter 00bb Enter, vim users can type C-k >>.)がそれを入力するのが簡単でないなら、2つのアングルブラケットを使うこともできます（>>）。

source: There are actually two assignment operators with different precedence.
ja: 優先順位の異なる2つの割り当て演算子が現に存在します。

source: There are multiple ways to write Pairs.
ja: Pairを書くには複数の方法があります。

source: There are several ways to compare objects in Perl.
ja: Perlではオブジェクトを比較するいくつかの方法があります。

source: There are three ways to declare formal parameters to a closure.
ja: クロージャに仮パラメータを宣言する方法が3つある。

source: There are two other variants.
ja: 2つの他の異形があります。

source: There does not seem to be a prevailing term in the industry for this, so we've coined the term lexotic to refer to these strange operations that perform a dynamic operation with a lexical target in mind.
ja: これに関して業界で一般的な語句が無いように思う。そういうわけで、レキシカルなターゲットを考慮して動的な操作を行うこれらの奇妙な操作を言及するために、我々はレギゾチックという語句を作った。

source: There is a when statement modifier, but it does not have any breakout semantics; it is merely a smartmatch against the current topic.
ja: when文修飾子があるが、なんの脱出のセマンティクスも持たない。それは単に現在のトピックに反してスマートマッチする。

source: There is a new state declarator that introduces a lexically scoped variable like my does, but with a lifetime that persists for the life of the closure, so that it keeps its value from the end of one call to the beginning of the next.
ja: 新しいstate宣言はmyがするようなレキシカルスコープの変数をもたらす。しかしライフタイムがクロージャの寿命の間持続するので、呼び出しの終わりから次の呼び出しまで値を保持する。

source: There is a special value named Nil.
ja: Nilという名前の特殊な値があります。

source: There is also a let prefix operator that sets a hypothetical value.
ja: 仮想の値をセットするlet接頭演算子もある。
